<template>
	<div class="flex justify-between">
		<Header title="Помощь" description="Часто задаваемые вопросы" />
		<a href="https://t.me/Vottak_manager" class="btn btn-primary btn-soft">
			Написать менеджеру
		</a>
	</div>

	<div class="flex flex-col gap-4">
		<div
			class="flex flex-col gap-2"
			v-for="(item, index) in questions"
			:key="index"
		>
			<h3 class="text-md font-medium opacity-65">{{ item.title }}</h3>
			<div class="flex flex-col gap-2">
				<div
					class="collapse bg-base-100 border border-base-300"
					v-for="(question, j) in item.subQuestions"
					:key="j"
				>
					<input type="radio" :name="`accordion-${index}`" :checked="j === 0" />
					<div class="collapse-title font-semibold">
						{{ question.question }}
					</div>
					<div class="collapse-content text-sm">
						{{ question.answer }}
					</div>
				</div>
			</div>
		</div>
	</div>
</template>

<script>
import { Header } from '../../../components/Header'

export default {
	components: {
		Header,
	},
	data: () => ({
		questions: [
			{
				title: 'Общие',
				subQuestions: [
					{
						question: 'Куда обращаться, если остались вопросы?',
						answer: 'Можно обратиться к нашему менеджеру.',
					},
					{
						question: 'С какого устройства я могу подключиться к сервису?',
						answer:
							'Вы можете подключиться с компьютера или смартфона, работающего на одной из последних версий IOS и Android. Для качественной видеосвязи желательно иметь доступ к WiFi на время сессии.',
					},
					{
						question:
							'Что такое консультация (сессия) с психологом? Как она проходит?',
						answer:
							'Консультация (сессия) с психологом дает прекрасную возможность проработать глубинные проблемы, которые мешают вам жить. Онлайн формат консультаций создает комфортную атмосферу и помогает личности полностью раскрыться. Вы просто сидите в любимом кресле и расслабленно делитесь своими переживаниями с выбранным вами специалистом.',
					},
					{
						question: 'Конфиденциальна ли моя информация?',
						answer:
							'Все, что вы рассказываете специалисту - остаётся только между вами. Это правило соблюдается всеми участниками нашей команды в соответствии с международным этическим кодексом. Кроме того, вы сами выбираете, какой объём информации о себе оставить в личном кабинете. Вы также можете соблюдать полную анонимность при желании.',
					},
					{
						question:
							'Сколько нужно ходить к психологу чтобы получить результат?',
						answer:
							'Вам нужно ходить к психологу столько, сколько понадобится. Это индивидуальный вопрос и вы обязательно обсудите это со своим специалистом на первой сессии. Довольно частая практика договориться на 10 консультаций, а по окончанию этого периода сверить со своими ощущениями.',
					},
				],
			},
			{
				title: 'Оплата',
				subQuestions: [
					{
						question: 'Как и когда оплачивается консультация?',
						answer:
							'Для бронирования сессии требуется оплатить. За 24 часа до начала консультации вся сумма становится невозвратной. Правило 24 часов — это стандартное правило в практике психотерапии. До этого времени вы можете бесплатно перенести или отменить сессию.',
					},
				],
			},
			{
				title: 'Бронирование сессии',
				subQuestions: [
					{
						question:
							'По какому часовому поясу отображается время на платформе?',
						answer:
							'На платформе вы видите время по часовому поясу, который установлен на вашем устройстве.',
					},
					{
						question: 'Как перенести или отменить консультацию?',
						answer:
							'Сессию можно отменить или перенести в личном кабинете не позднее чем за 24 часа до ее начала. Правило 24 часов — это стандартное правило в практике психотерапии. Оно обеспечивает дисциплину с обеих сторон и не дает пойти на поводу у чувств, которые могут возникнуть при приближении к действительно важным и глубоким темам.',
					},
				],
			},
			{
				title: 'Терапия',
				subQuestions: [
					{
						question: 'Как часто ходить на консультации?',
						answer:
							'Это вы решаете вместе со своим психологом, в зависимости от метода, в котором он работает и вашего запроса. Чаще всего мы рекомендуем посещать сессии раз в неделю.',
					},
					{
						question: 'Сколько длится консультация?',
						answer:
							'Стандартная сессия длится 50 минут. Это международный стандарт и в это заложены свои причины. Нам важно, чтобы вам было комфортно вернуться в обычную жизнь и получить на сессии ровно столько, сколько нужно и не оказаться выбитым из колеи. Для терапевта это комфортное время, в которое он может быть максимально включенным и сконцентрированным на вашем запросе, а после сессии успеть сделать заметки и настроиться на следующую сессию.',
					},
				],
			},
			{
				title: 'Специалисты',
				subQuestions: [
					{
						question: 'Как выбрать своего специалиста?',
						answer:
							'Специально для этого мы разработали анкету. Вопросы анкеты обширны и разнообразны, что позволит нам подобрать наиболее подходящего специалиста. Вы можете пойти по второму пути - выбрать специалиста самому, используя наши фильтры.',
					},
					{
						question:
							'Что делать если меня не устроил специалист или качество консультации?',
						answer:
							'Каждый случай будет рассмотрен индивидуально, напишите нам. Если терапевтом были нарушены этические нормы, либо наши правила — мы вернем Вам деньги.',
					},
					{
						question: 'Какие требования к специалистам на платформе?',
						answer:
							'Базовое высшее психологическое образование; Сертификация в одном из современных психотерапевтических подходов от 1100 часов; Опыт работы с клиентами от 3-х лет; Еженедельное прохождение личной терапии и супервизии.',
					},
					{
						question: 'Как вы отбираете психологов?',
						answer:
							'Каждый специалист должен соответствовать высоким требованиям и пройти строгий отбор согласно правилам платформы. Он включает в себя анкетирование, собеседование и проведение настоящей сессии под надзором экспертов. По итогам такой консультации претендент проводит анализ своей работы и команда принимает решение о допуске.',
					},
				],
			},
			{
				title: 'Проверка оборудования',
				subQuestions: [
					{
						question: 'Как проходит сессия?',
						answer:
							'Во время сессии вы разговариваете с психологом в модуле видеосвязи. Модуль состоит из большого экрана, на котором вы видите психолога, и маленького экрана, на котором вы видите себя и кнопки управления.',
					},
					{
						question: 'Как завершить сессию?',
						answer:
							'Вам ничего не надо делать для завершения сессии. Сессию завершит психолог.',
					},
					{
						question: 'Как обратиться за помощью?',
						answer:
							'Если у вас возникли вопросы по работе сервиса или сложности в использовании — вы в любой момент можете написать в чат поддержки.',
					},
					{
						question: 'Как подготовиться к сессии?',
						answer:
							'Непосредственно перед началом сессии выберите удобное и тихое место, где вы будете чувствовать себя комфортно. Следуйте нашей инструкции по подключению к сессии.',
					},
				],
			},
		],
	}),
}
</script>
